ЛИС2/src/Catalogs/ПриродоохранныеТехнологии/ПриродоохранныеТехнологии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПриродоохранныеТехнологии</name>
  <comment>Справочник предназначен для ведения природоохранных технологий, используемых в газопылевых установках.</comment>
  <tabularSections>
    <name>Эффетивность</name>
    <attributes>
      <name>ЗагрязняющееВещество</name>
      <type>
        <types>CatalogRef.ЗВАтмосфера</types>
        <types>CatalogRef.СуммыВеществ00010099</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОчисткиОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОчисткиДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Catalogs/ПриродоохранныеТехнологии/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПроверитьКорректностьПроцентОчистки( фпПриродоохраннаяТехнология, фпЗагрязняющееВещество, фпПроцентОчистки ) Экспорт

	стрРезультат = "";

	Если ЗначениеЗаполнено( фпПриродоохраннаяТехнология ) И ЗначениеЗаполнено( фпЗагрязняющееВещество ) Тогда
		текНайденнаяСтрока = фпПриродоохраннаяТехнология.Эффетивность.Найти( фпЗагрязняющееВещество, "ЗагрязняющееВещество" );
		Если текНайденнаяСтрока <> Неопределено Тогда 
			Если фпПроцентОчистки < текНайденнаяСтрока.ПроцентОчисткиОт Или фпПроцентОчистки > текНайденнаяСтрока.ПроцентОчисткиДо Тогда 
				стрРезультат =	"Неверный процент очистки. По природоохранной технологии '" + 
								фпПриродоохраннаяТехнология + "' значение должно быть между " +
								текНайденнаяСтрока.ПроцентОчисткиОт + " и " +текНайденнаяСтрока.ПроцентОчисткиДо;
			КонецЕсли;
		Иначе
			стрРезультат =	"По природоохранной технологии '" + 
							фпПриродоохраннаяТехнология + "' для загрязняющего вещества '" +
							фпЗагрязняющееВещество + "' процент очистки не задан";
		КонецЕсли;
	КонецЕсли;

	Возврат стрРезультат;

КонецФункции

#КонецОбласти
